embassy-rs/stm32-data-sources/svd/stm32h7a3.svd
        <register>
          <name>C15TCR</name>
          <displayName>C15TCR</displayName>
          <description>This register is used to configure the
          concerned channel.</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SINC</name>
              <description>Source increment mode These bits are set
              and cleared by software. These bits are protected and
              can be written only if EN is 0 Note: When source is
              AHB (SBUS=1), SINC = 00 is forbidden. In Linked List
              Mode, at the end of a block (single or last block in
              repeated block transfer mode), this register will be
              loaded from memory (from address given by current
              LAR[31:0] + 0x00).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DINC</name>
              <description>Destination increment mode These bits
              are set and cleared by software. These bits are
              protected and can be written only if EN is 0 Note:
              When destination is AHB (DBUS=1), DINC = 00 is
              forbidden.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SSIZE</name>
              <description>Source data size These bits are set and
              cleared by software. These bits are protected and can
              be written only if EN is 0 Note: If a value of 11 is
              programmed for the TCM access/AHB port, a transfer
              error will occur (TEIF bit set) If SINCOS &amp;lt;
              SSIZE and SINC &amp;#8800; 00, the result will be
              unpredictable. Note: SSIZE = 11 (double-word) is
              forbidden when source is TCM/AHB bus
              (SBUS=1).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DSIZE</name>
              <description>Destination data size These bits are set
              and cleared by software. These bits are protected and
              can be written only if EN is 0. Note: If a value of
              11 is programmed for the TCM access/AHB port, a
              transfer error will occur (TEIF bit set) If DINCOS
              &amp;lt; DSIZE and DINC &amp;#8800; 00, the result
              will be unpredictable. Note: DSIZE = 11 (double-word)
              is forbidden when destination is TCM/AHB bus
              (DBUS=1).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SINCOS</name>
              <description>source increment offset
              size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DINCOS</name>
              <description>Destination increment
              offset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SBURST</name>
              <description>source burst transfer
              configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DBURST</name>
              <description>Destination burst transfer
              configuration</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TLEN</name>
              <description>buffer transfer lengh</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>PKE</name>
              <description>PacK Enable These bit is set and cleared
              by software. If the Source Size is smaller than the
              destination, it will be padded according to the PAM
              value. If the Source data size is larger than the
              destination one, it will be truncated. The alignment
              will be done according to the PAM[0] value. This bit
              is protected and can be written only if EN is
              0</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAM</name>
              <description>Padding/Alignement Mode These bits are
              set and cleared by software. Case 1: Source data size
              smaller than destination data size - 3 options are
              valid. Case 2: Source data size larger than
              destination data size. The remainder part is
              discarded. When PKE = 1 or DSIZE=SSIZE, these bits
              are ignored. These bits are protected and can be
              written only if EN is 0</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRGM</name>
              <description>Trigger Mode These bits are set and
              cleared by software. Note: If TRGM is 11 for the
              current block, all the values loaded at the end of
              the current block through the linked list mechanism
              must keep the same value (TRGM=11) and the same SWRM
              value, otherwise the result is undefined. These bits
              are protected and can be written only if EN is
              0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SWRM</name>
              <description>SW Request Mode This bit is set and
              cleared by software. If a HW or SW request is
              currently active, the bit change will be delayed
              until the current transfer is completed. If the CxMAR
              contains a valid address, the CxMDR value will also
              be written @ CxMAR address. This bit is protected and
              can be written only if EN is 0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BWM</name>
              <description>Bufferable Write Mode This bit is set
              and cleared by software. This bit is protected and
              can be written only if EN is 0. Note: All MDMA
              destination accesses are non-cacheable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C15BNDTR</name>
          <displayName>C15BNDTR</displayName>
          <description>MDMA Channel x block number of data
          register</description>
          <addressOffset>0x414</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BNDT</name>
              <description>block number of data to
              transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
            </field>
            <field>
              <name>BRSUM</name>
              <description>Block Repeat Source address Update Mode
              These bits are protected and can be written only if
              EN is 0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRDUM</name>
              <description>Block Repeat Destination address Update
              Mode These bits are protected and can be written only
              if EN is 0.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRC</name>
              <description>Block Repeat Count This field contains
              the number of repetitions of the current block (0 to
              4095). When the channel is enabled, this register is
              read-only, indicating the remaining number of blocks,
              excluding the current one. This register decrements
              after each complete block transfer. Once the last
              block transfer has completed, this register can
              either stay at zero or be reloaded automatically from
              memory (in Linked List mode - i.e. Link Address
              valid). These bits are protected and can be written
              only if EN is 0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C15SAR</name>
          <displayName>C15SAR</displayName>
          <description>MDMA channel x source address
          register</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SAR</name>
              <description>source adr base</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C15DAR</name>
          <displayName>C15DAR</displayName>
          <description>MDMA channel x destination address
          register</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DAR</name>
              <description>Destination adr base</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C15BRUR</name>
          <displayName>C15BRUR</displayName>
          <description>MDMA channel x Block Repeat address Update
          register</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUV</name>
              <description>source adresse update
              value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DUV</name>
              <description>destination address update</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C15LAR</name>
          <displayName>C15LAR</displayName>
          <description>MDMA channel x Link Address
          register</description>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LAR</name>
              <description>Link address register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C15TBR</name>
          <displayName>C15TBR</displayName>
          <description>MDMA channel x Trigger and Bus selection
          Register</description>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSEL</name>
              <description>Trigger selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>SBUS</name>
              <description>Source BUS select This bit is protected
              and can be written only if EN is 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBUS</name>
              <description>Destination BUS slect This bit is
              protected and can be written only if EN is
              0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C15MAR</name>
          <displayName>C15MAR</displayName>
          <description>MDMA channel x Mask address
          register</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAR</name>
              <description>Mask address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C15MDR</name>
          <displayName>C15MDR</displayName>
          <description>MDMA channel x Mask Data
          register</description>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDR</name>
              <description>Mask data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
